---
kind: property
id: P:Autodesk.Revit.DB.ProjectPosition.NorthSouth
source: html/f0d0e79a-c1de-9cd6-82a8-664fc76e7e41.htm
---
# Autodesk.Revit.DB.ProjectPosition.NorthSouth Property

North/South offset

## Syntax (C#)
```csharp
public double NorthSouth { get; set; }
```

## Remarks
The offset of the project location from the site location in
 the north/south direction. Measured in decimal feet.